Revit 2026 API

# NurbsSurfaceDataGetKnotU Method

---

Get the knot in the u-direction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetKnotU(
	int idx
)
```
```vb
Public Function GetKnotU (
	idx As Integer
) As Double
```
```cpp
public:
double GetKnotU(
	int idx
)
```
```fsharp
member GetKnotU :
        idx : int -> float
```

#### Parameters

idx Int32
     The index of the knot.

#### Return Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | Out-of-range access. |

#### Reference

NurbsSurfaceData Class

Autodesk.Revit.DB Namespace